{
  "scenes": [
    {
      "id": 1,
      "title": "Пробуждение в темной клинике",
      "text": "Ты просыпаешься на жесткой койке в заброшенной клинике и слышишь странный шум, тебе кажется, что возможно, кто-то в соседней комнате. В воздухе чувствуется запах гнили, а свет в коридоре мигает.",
      "choices": [
        {
          "text": "Осмотреть комнату",
          "nextText": "Ты видишь старые медицинские инструменты, следы крови на полу и несколько бумажных записок.",
          "points": 10,
          "nextScene": 2
        },
        {
          "text": "Попробовать открыть дверь и выйти",
          "nextText": "Она заперта, но ты слышишь шаги за ней.",
          "points": 5,
          "nextScene": 3
        },
        {
          "text": "Спрятаться под кроватью",
          "nextText": "Тихо лежать и надеяться, что никто не заметит.",
          "points": 0,
          "nextScene": 4
        }
      ]
    },
    {
      "id": 2,
      "title": "Осмотр комнаты",
      "text": "Ты находишь ключ от двери и одну из записок. В ней говорится о секретных экспериментах на людях. Эта информация может помочь позже.",
      "choices": []
    },
    {
      "id": 3,
      "title": "Коридор с таинственным пациентом",
      "text": "Ты выходишь в коридор и видишь пациента, который бродит в поисках чего-то. Он выглядит растерянным и измотанным, но его глаза полны ужаса.",
      "choices": [
        {
          "text": "Подойти и поговорить с ним (возможно, он знает что-то важное.)",
          "nextText": "Он сообщает тебе, что слышал странные звуки из подвала и что нужно поспешить, потому что 'они' уже идут.",
          "points": 10,
          "nextScene": 5
        },
        {
          "text": "Спрятаться и наблюдать (не стоит рисковать, возможно, он опасен)",
          "nextText": "Ты видишь, как пациент исчезает в одной из комнат, но чувствуешь, что он оставил за собой странный след.",
          "points": 5,
          "nextScene": 6
        },
        {
          "text": "Попытаться убежать в противоположную сторону",
          "nextText": "Ты сталкиваешься с новой угрозой, за тобой начинают гнаться и ты оказываешься в ловушке.",
          "points": -10,
          "nextScene": 7
        }
      ]
    },
    {
      "id": 4,
      "title": "Спрятаться под кроватью",
      "text": "Ты остаешься незамеченным, но теряешь шанс найти полезные предметы в комнате.",
      "choices": []
    },
    {
      "id": 5,
      "title": "Пациент в коридоре: Подойти и поговорить",
      "text": "Пациент сообщает тебе, что слышал странные звуки из подвала и что нужно поспешить, потому что 'они' уже идут.",
      "choices": []
    },
    {
      "id": 6,
      "title": "Пациент в коридоре: Спрятаться и наблюдать",
      "text": "Ты видишь, как пациент исчезает в одной из комнат, но чувствуешь, что он оставил за собой странный след.",
      "choices": []
    },
    {
      "id": 7,
      "title": "Пациент в коридоре: Попытаться убежать",
      "text": "Ты сталкиваешься с новой угрозой, за тобой начинают гнаться и ты оказываешься в ловушке.",
      "choices": []
    },
    {
      "id": 8,
      "title": "Исследование тайной лаборатории",
      "text": "Ты попадаешь в лабораторию, где видишь множество экспериментов над людьми. В одной из клеток лежит тело, а на столах разбросаны документы. На стенах изображения с ужасными экспериментами.",
      "choices": [
        {
          "text": "Открыть документ на столе",
          "nextText": "Ты находишь информацию, которая поможет тебе открыть секретное помещение и найти способ побега.",
          "points": 10,
          "nextScene": 9
        },
        {
          "text": "Осмотреть тело в клетке",
          "nextText": "Ты обнаруживаешь странные изменения в теле, что намекает на страшные последствия экспериментов. Это пугает тебя, но ты понимаешь, что делаешь правильный выбор.",
          "points": 5,
          "nextScene": 9
        },
        {
          "text": "Убежать из лаборатории",
          "nextText": "Ты не находишь ключевых подсказок и лишаешься возможности раскрыть тайну.",
          "points": -5,
          "nextScene": 9
        }
      ]
    },
    {
      "id": 9,
      "title": "Финальная схватка или побег",
      "text": "Ты находишь последний выход, но перед ним появляется страшный монстр, созданный экспериментами. Тебе нужно выбрать, как действовать.",
      "choices": [
        {
          "text": "Сражаться с монстром",
          "nextText": "Ты побеждаешь его, но получаешь серьезные ранения. Выход свободен, но ты едва уцелел.",
          "points": 15,
          "nextScene": "ending_good"
        },
        {
          "text": "Попробовать убежать",
          "nextText": "Ты успеваешь скрыться, но с монстром остаются неизведанные коридоры, и ты не знаешь, что ждет тебя в будущем.",
          "points": 10,
          "nextScene": "ending_bad"
        },
        {
          "text": "Использовать найденный артефакт",
          "nextText": "Амулет действительно работает, но у тебя есть сомнения, что это решение приведет к верному концу.",
          "points": 20,
          "nextScene": "ending_unexpected"
        }
      ]
    },
    {
      "id": "ending_good",
      "title": "Хорошая концовка",
      "text": "Ты раскрываешь все тайны клиники, побеждаешь монстра и успешно сбегаешь с помощью найденных подсказок.",
      "choices": []
    },
    {
      "id": "ending_bad",
      "title": "Плохая концовка",
      "text": "Ты не успеваешь победить монстра или не раскрываешь все тайны, оставаясь в клинике навсегда.",
      "choices": []
    },
    {
      "id": "ending_unexpected",
      "title": "Неожиданная концовка",
      "text": "Артефакт спасает тебя, но ты оказываешься в новом мире, полном опасностей, где необходимо принять новые решения для выживания.",
      "choices": []
    }
  ]
}
