{
  "scenes": [
    {
      "id": "start",
      "title": "Пробуждение в темной клинике",
      "text": "\"Ты просыпаешься на жесткой койке в заброшенной клинике. Тусклый свет мигает, отбрасывая рваные тени на облупленные стены. Воздух пропитан запахом гнили и чего-то, от чего хочется задержать дыхание. В тишине раздается странный, еле слышный звук – кажется, кто-то есть в соседней комнате. Внезапно тишину пронзает громкий, настойчивый стук в дверь… \n",
      "choices": [
        { "text": "Попробовать открыть дверь и выйти", "nextSceneId": "open_door" },
        { "text": "Спрятаться под кроватью", "nextSceneId": "hide_under_bed" },
        { "text": "Осмотреть комнату", "nextSceneId": "explore_room" }
      ]
    },
    {
      "id": "open_door",
      "text": "Ты осторожно поворачиваешь ручку, и дверь резко распахивается. Из темноты вырывается человек – растрёпанный, измождённый, но больше всего пугают его глаза, полные ужаса. Он судорожно хватает тебя за руку и, почти выкрикивая, твердит: \n           «мы умрем, нам не спастись, Они уже рядом ..» . \n  Не давая тебе опомниться, он рывком тащит тебя за собой в мрачный коридор, бормоча что-то невнятное, будто убегая от самого кошмара…",
      "choices": []
    },
    {
      "id": "hide_under_bed",
      "text": "Ты ныряешь под кровать, затаив дыхание. В этот момент раздается гулкий взрыв – стена с треском рушится. Звуки за дверью резко обрываются. Пыль окутывает комнату плотной завесой, и сквозь нее ты замечаешь… глаза. Бездушные, пристальные…. Они смотрят прямо на тебя. Мгновение – и они исчезают. \n  Осторожно выбираясь из-под кровати, ты подходишь к огромной дыре в стене, но тебя не покидает то чувство что ты не один, по спине пробегает холод, а чей-то шепот проникает прямо в сознание:\n\"Беги…\"\nТы застываешь, но голос звучит вновь – теперь настойчивее, громче:\n\"БЕГИ!\"\n",
      "choices": [
        { "text": "Бежать", "nextSceneId": "run" }
      ]
    },
    {
      "id": "explore_room",
      "text": "Ты оглядываешься. Везде Обшарпанные стены, старая мебель, ржавые медицинские инструменты… На полу следы засохшей крови. Твое внимание привлекает стол, заваленный скомканными записями. Разгребая хаос, ты находишь исписанные бумажки и… странный список или анкета. В нем изображение каких то детей, а снизу написаны какие то данные: имя, фамилия, и также каждому был приписан номер. Эти дети тебе кажуться очень знакомые, но ты не можешь вспомнить почему.. Присмотревшись ты замечаешь там и свою фотографию, отдельно ото всех..\nЧто происходит? Задаешься ты вопросом, пытаясь понять или что то вспомнить.",
      "choices": [
        { "text": "Осмотреть анкету", "nextSceneId": "lines", "miniGame": "anketa" }
      ]
    },
    {
      "id": "lines",
      "text": "Холодный страх омывает тело. Ты делаешь шаг назад, прижимаясь к стене – и вдруг что-то щёлкает. Вдруг стена поворачивается, уводя тебя за собой. Ты стоишь в узком коридоре, освещённом лишь слабым мигающим светом из щели за его спиной, где ещё секунду назад была палата. Впереди — темнота, и тишина настолько плотная, что начинает звенеть в ушах. Осмотревшись, замечаешь два пути: посмотрев направо, видишь тонкую красную линию, похожую на след от мела или крови. Линия идет вдоль стены, уходя в темноту.",
      "choices": [
        { "text": "Следовать по линии", "nextSceneId": "manitor_continue", "miniGame": "gloves" },
        { "text": "Пойти другим путём", "nextSceneId": "lines_no" }
      ]
    },



    {
      "id": "lines_no",
      "text": " Путь манил своей неизвестностью, но что-то внутри подсказывало: не стоит. Темный коридор тянулся вперед, ты почти ничего не видел. Вдруг перед тобой появилось странное зеркало. Ты подошел ближе — и заметил: отражение не совпадает. Оно похоже на тебя, но будто... иное. Неожиданно отражение заговорило:\n\n— Давай поиграем!\n\nТы застываешь в страхе. Отражение переворачивается вверх тормашками и, широко улыбаясь, продолжает:\n\n— Угадай цифру. Если угадаешь — пройдёшь. А если нет... (пауза) да и не важно. Меньше знаешь — крепче спишь.\n\n",
      "choices": [
        { "text": "поиграть", "nextSceneId": "mirror_continue", "miniGame": "mirror" }
      ]
    },
    {
      "id": "mirror_continue",
      "text": "Ты продолжаешь путь по коридору почти вслепую. Странная аура всё усиливается. Внезапно ты задеваешь что-то рукой — раздается характерный щелчок, и сверху падает лестница. Ты вздрагиваешь от неожиданности, но понимаешь, что выбора нет. Ты начинаешь подниматься. Лестница скрипит и шатается, но ты добираешься до верха. Перед тобой — странная сцена: класс, будто из монастыря XII века. Ты уже ничему не удивляешься.",
      "choices": [
        { "text": "Осмотреть комнату ", "nextSceneId": "true_choice", "miniGame": "picture_key" },
        { "text": "Выйти из комнаты", "nextSceneId": "exit" }
      ]
    },
    {
      "id": "exit",
      "text": "Ты oткрываешь дверь — снова коридор. Вдруг ты слышишь звуки марша, которые приближаются к тебе. В панике ты бежишь в конец коридора, там дверь, ты надеяшься на спасение но подойдя к двери дверь оказывается заперта, и звуки настигают тебя.",
      "isGameOver": true,
      "choices": []
    },


    {
      "id": "manitor_continue",
      "text": "Ты медленно опускаешь фотографию, пальцы дрожат. ты оглядываешься   замечая мигание монитора,которое манит тебя, но приблизившись ты замечаешь, что там пороль. попробовав несколько раз подобрать пароль, вспоминаешь, что где то в разбросанных бумагах видел дневник, возможно он и поможет тебе.",
      "choices": [
        { "text": "Найти дневник", "nextSceneId": "diary_found", "miniGame": "find_book" }
      ]
    },
    {
      "id": "diary_found",
      "text": "Ты находишь дневник, и открыв первую же страницу, видишь какие то цифры и внизу нарисован компьютер.",
      "choices": [
        { "text": "Попробовать написать пароль", "nextSceneId": "parol_continue", "miniGame": "parol" }
      ]
    },

    {
      "id": "parol_continue",
      "text": "Пароль подошёл! он мигает  и на экране  ты видишь медицинские записи, диаграммы активности мозга, и снова — твое имя. Только теперь рядом: Диагноз — параноидная шизофрения. Подопытный №017. Сердце начинает биться быстрее. \n. ты отходишь назад, задевает тележку — она грохочет, разбивая тишину. И вдруг — звук. Скрип. Как будто кто-то идёт. ты бросаешься к выходу из лаборатории, по коридору назад, но коридор теперь кажется длиннее, чем был. Стены сужаются, свет гаснет. Только тонкая красная линия все еще тянется по стене. “Найди выход”… шепчет тебе голос. Или это все же твои мысли?\n",
      "choices": [
        { "text": "Продолжить", "nextSceneId": "diagram_scene", "miniGame": "diagram" }
      ]
    },

    {
      "id": "diagram_scene",
      "text": "ты отходишь назад, задевает тележку — она грохочет, разбивая тишину. И вдруг — звук. Скрип. Как будто кто-то идёт. ты бросаешься к выходу из лаборатории, по коридору назад, но коридор теперь кажется длиннее, чем был. Стены сужаются, свет гаснет. Только тонкая красная линия все еще тянется по стене. “Найди выход”… шепчет тебе голос. Или это все же твои мысли?\nОн останавливается, пытается отдышаться. И тогда ты вспоминаешь… Ты уже был здесь, эти мониторы, надписи, комнаты, все слишком знакомо, ты убегаешь по коридору и замечаешь свет.\n",
      "choices": [
        { "text": "Узнать правду", "nextSceneId": "true2" }
      ]
    },
    {
      "id": "true2",
      "text": "Симуляция завершена.\nСубъект 017. Реакция стабильна. Уровень агрессии — высокий. Самоидентификация — фрагментирована. Продолжается внутренняя терапевтическая проработка.\nТы смотришь вокруг. Лаборатория исчезает. Коридор растворяется. Ты сидишь на полу белой палаты. На тебе смирительная рубашка.За толстым стеклом фигура в белом халате. Он поднимает взгляд — и ты его узнаешь. На тебе капельница а рядом медсестра, он смотрит на тебя нахмурившись, а потом на медсестру и говорит - “ты опять перепутала дозу”\nТы закрываешь глаза.\nВ этот раз — по-настоящему…\n",
      "choices": [
        { "text": "Попробовать написать пароль" }
      ]
    },

    {
      "id": "run",
      "text": "И вдруг… что-то касается твоей руки. Сердце обрывается, и ты бросаешься прочь. Бег по темному коридору кажется бесконечным, темнота, ничего не видно, ты не понимаешь куда бежать. Ты попадаешь в темную комнату, где ничего не видно, а ОНО шепчет \\\"найди ключ\\\"\\",
      "choices": [
        { "text": "Поискать ключ", "nextSceneId": "surch_key", "miniGame": "flashlight_key" },
        { "text": "Бежать", "nextSceneId": "run2" }
      ]
    },
    {
      "id": "surch_key",
      "text": "Комната освещается, и ты уже можешь заметить две двери: “Красная дверь” и “Желтая дверь”. А за тобой уже стоит ОНО и шепчет: \"Два пути перед тобой: один ведет в бездну, другой — в неизвестность… У тебя лишь 10 секунд, чтобы выбрать.\" Тишина… лишь звук часов и приглушённые голоса: \"Red door… Yellow door… Any other door…\"",
      "choices": [
        { "text": "Выбрать дверь", "nextSceneId": "door_choice", "miniGame": "door_choice" }
      ]
    },
    {
      "id": "surch_key_fail",
      "text": "Ты не успел найти ключ. Темнота сгущается вокруг, и голос, тот самый шепчущий голос, звучит всё громче: \"Ты не смог… Теперь ты мой.\" Комната начинает дрожать, и ты чувствуешь, как что-то тянет тебя вниз, в бездну. Твои крики тонут в тишине, и последнее, что ты видишь, — это отражение твоих собственных пустых глаз в темноте.",
      "isGameOver": true,
      "choices": []
    },
    {
      "id": "run2",
      "text": "Страх берет верх и ты решаешь убежать. Ты поворачиваешься и бежишь прочь, прочь от темноты, от голоса, от неизвестности. Но коридор, в который ты врываешься, оказывается не тем, что ты ожидал. Пол под ногами кажется мягким, как ткань… и вдруг ты проваливаешься в него. Ты кричишь, но звука нет. Пространство поглощает тебя и ты попадаешь в белой, безликой комнате. Посреди комнаты — зеркало, а в нём — ты. Только глаза твои пустые. Ты не двигаешься. Ты не управляешь собой. Из зеркала доносится голос — уже знакомый, шепчущий, довольный: \"Ты сделал свой выбор. Теперь ты — один из нас.\"",
      "isGameOver": true,
      "choices": []
    },
    {
      "id": "yellow_door",
      "text": "Дверь со скрипом открылась, у тебя билось сердце и произошло то что ты боялся больше всего. Позади раздается холодный смех и... Тупик.",
      "isGameOver": true,
      "choices": []
    },
    {
      "id": "red_door",
      "text": "Дверь со скрипом открылась, каждая секунда была очень мучительной и да! Ты сделал верный выбор и убежал в ту комнату, а за спиной слышится зловещий шепот: \"Это ещё не конец…\"",
      "choices": [
        {"text": "Продолжить", "nextSceneId": "red_door_continue"}
      ]
    },
    {
      "id": "red_door_continue",
      "text": "Ты входишь в красную дверь. Мягкий свет, приглушенная тишина. Всё кажется… нормальным. Даже слишком. Коридор перед тобой выглядит так же, как и до кошмара — словно всё это был лишь сон. Ты медленно идешь вперед… и тут замечаешь 4 детских рисунка на полу.Там изображен ты и твои предыдущие выборы",
      "choices": [
        { "text": "Посмотреть картинки", "nextSceneId": "pictures_after",  "miniGame": "pictures_see" }
      ]
    },

    {
      "id": "pictures_after",
      "text": "Ты оборачиваешься… и Оно стоит позади. Высокая тень, лицо не видно, но ты чувствуешь, что Оно… знает тебя. Оно не двигается, но голос звучит прямо в твоей голове: \"Ты всё ещё не понял, да? Здесь нет правильного пути. Только плата.\n Либо умрёшь ты...\n ...либо кто-то вместо тебя.\n Выбирай.\"\n",
      "choices": [
        { "text": "умереть", "isGameOver": true},
        { "text": "выжить", "nextSceneId": "survive" }
      ]
    },
    {
      "id": "survive",
      "text": "Оно кивает.\n Коридор исчезает, и ты падаешь в комнату, полную зеркал. Они кривые, живые. Все отражают разные версии тебя, и все смеются. Один из них выходит вперед.\n🪞Отражение говорит: “Ещё раз спрашиваю… смерть или жизнь?\n Но помни: иногда смерть лучше, чем правда и жизнь требует испытания.\"",
      "choices": [
        { "text": "умереть", "isGameOver": true},
        { "text": "выжить", "nextSceneId": "survive2" }
      ]
    },

    {
      "id": "survive2",
      "text": "Зеркало трескается.Ты падаешь сквозь него — и оказываешься в зеркальном лабиринте. Комната кажется бесконечной. Кривые зеркала отражают тебя с искажениями, и каждый шаг даёт ощущение, будто ты идёшь не туда.\n Внезапно, голос шепчет:\n\"Выйди... если сможешь. Но помни — не всем нравится то, что они увидят.\"\n",
      "choices": [
        { "text": "пройти испытания", "nextSceneId": "pillar_continue", "miniGame": "pillar_riddle" }
      ]
    },
    {
      "id": "pillar_continue",
      "text": "Столбы рушаться и появляеться выход — одно из зеркал начинает трястись, в нем появляется свет и голос: \n“Добро пожаловать… в правду.”\nТы проходишь сквозь него — и Ты оказываешься в детской палате той же клиники. Тут всё чисто и светло… но пусто.\nНа кровати — твоя фотография. На обороте — надпись:\n",
      "choices": [
        { "text": "Посмотреть фотографию", "nextSceneId": "true_continue", "miniGame": "true"}
      ]
    },
    {
      "id": "true_continue",
      "text": "Белый свет окутывает тебя. Ты просыпаешься. Вокруг — белая больничная палата. Свет. Тишина. Твои друзья стоят рядом, у них на глазах слёзы.Отец держит тебя за руку, дрожащим голосом шепчет: \n\"Ты вернулся… Сынок…\"\nИ ты вспоминаешь все, последняя ночь, ночевка с друзьями и эту чертову игру “Красная дверь, желтая дверь”.. ты все осознаешь․ \"Операция прошла успешно. Сознание восстановилось.- голос врача  как будто вывел  тебя из транса. Он продолжил - Но.. мне очень жаль донор не выжила. \nТы поворачиваешь голову и видишь — на столе лежит мамино фото. и ты все осознаешь.. Голова начинает кружиться. Камера медленно отдаляется. Последний кадр — твоё лицо в слезах. А за стеклом больничной палаты — отражение. Оно улыбается.\n ",
      "choices": [
        { "text": "Посмотреть фотографию", "nextSceneId": "true_continue", "miniGame": "true"}
      ]
    }

  ]
}