{
  "scenes": [
    {
      "id": 1,
      "title": "Пробуждение в темной клинике",
      "text": "Ты просыпаешься на жесткой койке в заброшенной клинике. Тусклый свет мигает, отбрасывая рваные тени на облупленные стены. Воздух пропитан запахом гнили и чего-то, от чего хочется задержать дыхание. В тишине раздается странный, еле слышный звук – кажется, кто-то есть в соседней комнате. Внезапно тишину пронзает громкий, настойчивый стук в дверь…",
      "choices": [
        {"text": "Попробовать открыть дверь и выйти", "nextScene": 2},
        {"text": "Спрятаться под кроватью", "nextScene": 3},
        {"text": "Осмотреть комнату", "nextScene": 4}
      ]
    },
    {
      "id": 2,
      "text": "Ты осторожно поворачиваешь ручку, и дверь резко распахивается. Из темноты вырывается человек – растрёпанный, измождённый, но больше всего пугают его глаза, полные ужаса. Он судорожно хватает тебя за руку и, почти выкрикивая, твердит: 'Мы умрем, нам не спастись, Они уже рядом…' Не давая тебе опомниться, он рывком тащит тебя за собой в мрачный коридор, бормоча что-то невнятное, будто убегая от самого кошмара…",
      "choices": []
    },
    {
      "id": 3,
      "text": "Ты ныряешь под кровать, затаив дыхание. В этот момент раздается гулкий взрыв – стена с треском рушится. Пыль окутывает комнату плотной завесой, и сквозь нее ты замечаешь… глаза. Они смотрят прямо на тебя. Мгновение – и они исчезают. Осторожно выбираясь из-под кровати, ты подходишь к огромной дыре в стене, но тебя не покидает то чувство, что ты не один, по спине пробегает холод, а чей-то шепот проникает прямо в сознание: 'Беги…'. Ты застываешь, но голос звучит вновь – теперь настойчивее, громче: 'БЕГИ!'. И вдруг… что-то касается твоей руки. Сердце обрывается, и ты бросаешься прочь. Бег по темному коридору кажется бесконечным, пока ты не влетаешь в комнату. Там две двери – 'Красная дверь' и 'Желтая дверь'. Позади раздается зловещий шепот: 'Два пути перед тобой: один ведет в бездну, другой — в неизвестность… У тебя лишь 10 секунд, чтобы выбрать.'.",
      "choices": [
        {"text": "Войти в красную дверь", "nextScene": 5},
        {"text": "Войти в желтую дверь", "nextScene": 6}
      ]
    },
    {
      "id": 4,
      "text": "Ты оглядываешься. Вокруг обшарпанные стены, старая мебель, ржавые медицинские инструменты… На полу следы засохшей крови. Твоё внимание привлекает стол, заваленный скомканными записями. Разгребая хаос, ты находишь исписанные бумажки и… странный список. В нём неясные изображения и названия: SCP-096, SCP-106… Холодный страх сковывает тело. Ты делаешь шаг назад, прижимаясь к стене – и вдруг что-то щёлкает. В одно мгновение пол уходит из-под ног, комната переворачивается, и ты падаешь… в другую реальность.",
      "choices": []
    },
    {
      "id": 5,
      "text": "Дверь со скрипом открылась, у тебя билось сердце и произошло то, что ты боялся больше всего. Позади раздается холодный смех... и... Тупик. Game Over. Ты проиграл!",
      "choices": []
    },
    {
      "id": 6,
      "text": "Дверь со скрипом открылась, каждая секунда была мучительной... и да! Ты сделал верный выбор и убежал в ту комнату, а за спиной слышится зловещий шепот: 'Это ещё не конец…'",
      "choices": []
    }
  ]
}
