{
  "scenes": [
    {
      "id": "start",
      "title": "Пробуждение в темной клинике",
      "text": "Ты просыпаешься на жесткой койке в заброшенной клинике. Тусклый свет мигает, отбрасывая рваные тени на облупленные стены. Воздух пропитан запахом гнили и чего-то, от чего хочется задержать дыхание. В тишине раздается странный, еле слышный звук – кажется, кто-то есть в соседней комнате. Внезапно тишину пронзает громкий, настойчивый стук в дверь…",
      "choices": [
        { "text": "Попробовать открыть дверь и выйти", "nextSceneId": "open_door" },
        { "text": "Спрятаться под кроватью", "nextSceneId": "hide_under_bed" },
        { "text": "Осмотреть комнату", "nextSceneId": "explore_room" }
      ]
    },
    {
      "id": "open_door",
      "text": "Ты осторожно поворачиваешь ручку, и дверь резко распахивается. Из темноты вырывается человек – растрёпанный, измождённый, но больше всего пугают его глаза, полные ужаса. Он судорожно хватает тебя за руку и, почти выкрикивая, твердит: \"мы умрем, нам не спастись, Они уже рядом ..\" Не давая тебе опомниться, он рывком тащит тебя за собой в мрачный коридор, бормоча что-то невнятное, будто убегая от самого кошмара…",
      "choices": []
    },
    {
      "id": "hide_under_bed",
      "text": "Ты ныряешь под кровать, затаив дыхание. В этот момент раздается гулкий взрыв – стена с треском рушится. Звуки за дверью резко обрываются. Пыль окутывает комнату плотной завесой, и сквозь нее ты замечаешь… глаза. Бездушные, пристальные. Они смотрят прямо на тебя. Мгновение – и они исчезают. Осторожно выбираясь из-под кровати, ты подходишь к огромной дыре в стене, но тебя не покидает то чувство, что ты не один. По спине пробегает холод, а чей-то шепот проникает прямо в сознание: \"Беги…\" Ты застываешь, но голос звучит вновь – теперь настойчивее, громче: \"БЕГИ!\"",
      "choices": [
        { "text": "Бежать", "nextSceneId": "run" }
      ]
    },
    {
      "id": "run",
      "text": "И вдруг… что-то касается твоей руки. Сердце обрывается, и ты бросаешься прочь. Бег по темному коридору кажется бесконечным, пока ты не взлетаешь в комнату. Ты попадаешь в темную комнату, где ничего не видно, а ОНО шепчет: \"найди ключ\"",
      "choices": [
        { "text": "Поискать ключ", "nextSceneId": "surch_key", "miniGame": "flashlight_key" },
        { "text": "Бежать", "nextSceneId": "run2" }
      ]
    },
    {
      "id": "surch_key",
      "text": "Комната освещается, и ты уже можешь заметить две двери: \"Красная дверь\" и \"Желтая дверь\". А за тобой уже стоит ОНО и шепчет: \"Два пути перед тобой: один ведет в бездну, другой — в неизвестность… У тебя лишь 10 секунд, чтобы выбрать.\" Тишина… лишь звук часов и приглушенные голоса: \"Red door… Yellow door… Any other door…\"",
      "choices": [
        { "text": "Войти в красную дверь", "nextSceneId": "red_door" },
        { "text": "Войти в желтую дверь", "nextSceneId": "yellow_door" }
      ]
    },
    {
      "id": "run2",
      "text": "Страх берет верх, и ты решаешь убежать. Ты поворачиваешься и бежишь прочь, прочь от темноты, от голоса, от неизвестности. Но коридор, в который ты врываешься, оказывается не тем, что ты ожидал. Пол под ногами кажется мягким, как ткань… и вдруг ты проваливаешься в него. Ты кричишь, но звука нет. Пространство поглощает тебя, и ты попадаешь в белой, безликой комнате. Посреди комнаты — зеркало, а в нём — ты. Только глаза твои пустые. Ты не двигаешься. Ты не управляешь собой. Из зеркала доносится голос — уже знакомый, шепчущий, довольный: \"Ты сделал свой выбор. Теперь ты — один из нас.\"",
      "choices": [
        { "text": "Конец", "nextSceneId": "end_game" }
      ]
    },
    {
      "id": "red_door",
      "text": "Дверь со скрипом открылась, и произошло то, чего ты боялся больше всего. Позади раздается холодный смех и... Тупик.",
      "choices": [
        { "text": "Конец", "nextSceneId": "end_game" }
      ]
    },
    {
      "id": "yellow_door",
      "text": "Дверь со скрипом открылась, каждая секунда была мучительной, но ты сделал верный выбор и убежал в ту комнату. А голос за спиной шепчет: \"Это ещё не конец…\"",
      "choices": [
        { "text": "Продолжить", "nextSceneId": "yellow_door_continue" }
      ]
    }
  ]
}
