{
  "scenes": [
    {
      "id": "start",
      "title": "Пробуждение в темной клинике",
      "text": "\"Ты просыпаешься на жесткой койке в заброшенной клинике. Тусклый свет мигает, отбрасывая рваные тени на облупленные стены. Воздух пропитан запахом гнили и чего-то, от чего хочется задержать дыхание. В тишине раздается странный, еле слышный звук – кажется, кто-то есть в соседней комнате. Внезапно тишину пронзает громкий, настойчивый стук в дверь… \n",
      "choices": [
        { "text": "Попробовать открыть дверь и выйти", "nextSceneId": "open_door" },
        { "text": "Спрятаться под кроватью", "nextSceneId": "hide_under_bed" },
        { "text": "Осмотреть комнату", "nextSceneId": "explore_room" }
      ]
    },
    {
      "id": "open_door",
      "text": "Ты осторожно поворачиваешь ручку, и дверь резко распахивается. Из темноты вырывается человек – растрёпанный, измождённый, но больше всего пугают его глаза, полные ужаса. Он судорожно хватает тебя за руку и, почти выкрикивая, твердит: \n           «мы умрем, нам не спастись, Они уже рядом ..» . \n  Не давая тебе опомниться, он рывком тащит тебя за собой в мрачный коридор, бормоча что-то невнятное, будто убегая от самого кошмара…",
      "choices": []
    },
    {
      "id": "hide_under_bed",
      "text": "Ты ныряешь под кровать, затаив дыхание. В этот момент раздается гулкий взрыв – стена с треском рушится. Звуки за дверью резко обрываются. Пыль окутывает комнату плотной завесой, и сквозь нее ты замечаешь… глаза. Бездушные, пристальные…. Они смотрят прямо на тебя. Мгновение – и они исчезают. \n  Осторожно выбираясь из-под кровати, ты подходишь к огромной дыре в стене, но тебя не покидает то чувство что ты не один, по спине пробегает холод, а чей-то шепот проникает прямо в сознание:\n\"Беги…\"\nТы застываешь, но голос звучит вновь – теперь настойчивее, громче:\n\"БЕГИ!\"\n",
      "choices": [
        { "text": "Бежать", "nextSceneId": "run" }
      ]
    },
    {
      "id": "explore_room",
      "text": "Ты начинаешь осматривать комнату, стараясь не издавать лишних звуков. В углу замечаешь старый шкаф, покрытый пылью. На полу валяется разбитое зеркало, а рядом – ржавая металлическая коробка с замком. Стук в дверь становится громче, и ты чувствуешь, как стены будто сжимаются вокруг тебя. Нужно действовать быстро.",
      "choices": [
        { "text": "Открыть шкаф", "nextSceneId": "open_wardrobe" },
        { "text": "Осмотреть коробку", "nextSceneId": "examine_box" },
        { "text": "Попробовать открыть дверь", "nextSceneId": "open_door" }
      ]
    },
    {
      "id": "open_wardrobe",
      "text": "Шкаф скрипит, когда ты открываешь его дверцы. Внутри – старые медицинские халаты, пахнущие плесенью, и что-то, похожее на связку ключей, висящую на крючке. Но в тот момент, как ты тянешься к ключам, из глубины шкафа раздается низкий, утробный звук. Ты замираешь. Что-то шевелится в темноте.",
      "choices": [
        { "text": "Взять ключи", "nextSceneId": "take_keys" },
        { "text": "Закрыть шкаф и отступить", "nextSceneId": "close_wardrobe" }
      ]
    },
    {
      "id": "examine_box",
      "text": "Ты подбираешь коробку. Она тяжелая, и замок выглядит прочным. На крышке выгравированы странные символы, похожие на буквы, но ты не можешь их разобрать. Стук в дверь превращается в ритмичный грохот, и ты слышишь, как что-то скребется с той стороны. У тебя мало времени.",
      "choices": [
        { "text": "Попробовать взломать замок", "nextSceneId": "break_box" },
        { "text": "Оставить коробку и открыть дверь", "nextSceneId": "open_door" }
      ]
    },
    {
      "id": "take_keys",
      "text": "Ты хватаешь ключи, но в тот же момент что-то холодное и липкое касается твоей руки. Ты отдергиваешь руку, но шкаф с грохотом захлопывается. Темнота вокруг сгущается, и ты слышишь шепот: \"Ты не должен был этого делать...\" Комната начинает дрожать, и ты понимаешь, что бежать уже некуда.",
      "isGameOver": true,
      "choices": []
    },
    {
      "id": "close_wardrobe",
      "text": "Ты быстро закрываешь шкаф и отступаешь назад. Шум изнутри стихает, но стук в дверь становится невыносимым. Ты чувствуешь, как воздух становится тяжелее, будто кто-то наблюдает за тобой. Нужно что-то делать.",
      "choices": [
        { "text": "Открыть дверь", "nextSceneId": "open_door" },
        { "text": "Осмотреть коробку", "nextSceneId": "examine_box" }
      ]
    },
    {
      "id": "break_box",
      "text": "Ты пытаешься взломать замок, но он не поддаётся. Грохот за дверью становится оглушительным, и внезапно дверь срывается с петель. В комнату врывается тьма, и ты чувствуешь, как что-то хватает тебя. Последнее, что ты слышишь, – это холодный, торжествующий смех.",
      "isGameOver": true,
      "choices": []
    },
    {
      "id": "run",
      "text": "И вдруг… что-то касается твоей руки. Сердце обрывается, и ты бросаешься прочь. Бег по темному коридору кажется бесконечным, темнота, ничего не видно, ты не понимаешь куда бежать. Ты попадаешь в темную комнату, где ничего не видно, а ОНО шепчет \\\"найди ключ\\\"\\",
      "choices": [
        { "text": "Поискать ключ", "nextSceneId": "surch_key", "miniGame": "flashlight_key" },
        { "text": "Бежать", "nextSceneId": "run2" }
      ]
    },
    {
      "id": "surch_key",
      "text": "Комната освещается, и ты уже можешь заметить две двери: “Красная дверь” и “Желтая дверь”. А за тобой уже стоит ОНО и шепчет: \"Два пути перед тобой: один ведет в бездну, другой — в неизвестность… У тебя лишь 10 секунд, чтобы выбрать.\" Тишина… лишь звук часов и приглушённые голоса: \"Red door… Yellow door… Any other door…\"",
      "choices": [
        { "text": "Выбрать дверь", "nextSceneId": "door_choice", "miniGame": "door_choice" }
      ]
    },
    {
      "id": "surch_key_fail",
      "text": "Ты не успел найти ключ. Темнота сгущается вокруг, и голос, тот самый шепчущий голос, звучит всё громче: \"Ты не смог… Теперь ты мой.\" Комната начинает дрожать, и ты чувствуешь, как что-то тянет тебя вниз, в бездну. Твои крики тонут в тишине, и последнее, что ты видишь, — это отражение твоих собственных пустых глаз в темноте.",
      "isGameOver": true,
      "choices": []
    },
    {
      "id": "run2",
      "text": "Страх берет верх и ты решаешь убежать. Ты поворачиваешься и бежишь прочь, прочь от темноты, от голоса, от неизвестности. Но коридор, в который ты врываешься, оказывается не тем, что ты ожидал. Пол под ногами кажется мягким, как ткань… и вдруг ты проваливаешься в него. Ты кричишь, но звука нет. Пространство поглощает тебя и ты попадаешь в белой, безликой комнате. Посреди комнаты — зеркало, а в нём — ты. Только глаза твои пустые. Ты не двигаешься. Ты не управляешь собой. Из зеркала доносится голос — уже знакомый, шепчущий, довольный: \"Ты сделал свой выбор. Теперь ты — один из нас.\"",
      "isGameOver": true,
      "choices": []
    },
    {
      "id": "yellow_door",
      "text": "Дверь со скрипом открылась, у тебя билось сердце и произошло то что ты боялся больше всего. Позади раздается холодный смех и... Тупик.",
      "isGameOver": true,
      "choices": []
    },
    {
      "id": "red_door",
      "text": "Дверь со скрипом открылась, каждая секунда была очень мучительной и да! Ты сделал верный выбор и убежал в ту комнату, а за спиной слышится зловещий шепот: \"Это ещё не конец…\"",
      "choices": [
        {"text": "Продолжить", "nextSceneId": "red_door_continue"}
      ]
    },
    {
      "id": "red_door_continue",
      "text": "Ты входишь в красную дверь. Мягкий свет, приглушенная тишина. Всё кажется… нормальным. Даже слишком. Коридор перед тобой выглядит так же, как и до кошмара — словно всё это был лишь сон. Ты медленно идешь вперед… и тут замечаешь 4 детских рисунка на полу.Там изображен ты и твои предыдущие выборы",
      "choices": [
        { "text": "Посмотреть картинки", "nextSceneId": "pictures_after",  "miniGame": "pictures_see" }
      ]
    },

    {
      "id": "pictures_after",
      "text": "Ты оборачиваешься… и Оно стоит позади. Высокая тень, лицо не видно, но ты чувствуешь, что Оно… знает тебя. Оно не двигается, но голос звучит прямо в твоей голове: \"Ты всё ещё не понял, да? Здесь нет правильного пути. Только плата.\n Либо умрёшь ты...\n ...либо кто-то вместо тебя.\n Выбирай.\"\n",
      "choices": [
        { "text": "умереть", "isGameOver": true},
        { "text": "выжить", "nextSceneId": "survive" }
      ]
    },
    {
      "id": "survive",
      "text": "Оно кивает.\n Коридор исчезает, и ты падаешь в комнату, полную зеркал. Они кривые, живые. Все отражают разные версии тебя, и все смеются. Один из них выходит вперед.\n🪞Отражение говорит: “Ещё раз спрашиваю… смерть или жизнь?\n Но помни: иногда смерть лучше, чем правда и жизнь требует испытания.\"",
      "choices": [
        { "text": "умереть", "isGameOver": true},
        { "text": "выжить", "nextSceneId": "survive2" }
      ]
    },

    {
      "id": "survive2",
      "text": "Зеркало трескается.Ты падаешь сквозь него — и оказываешься в зеркальном лабиринте. Комната кажется бесконечной. Кривые зеркала отражают тебя с искажениями, и каждый шаг даёт ощущение, будто ты идёшь не туда.\n Внезапно, голос шепчет:\n\"Выйди... если сможешь. Но помни — не всем нравится то, что они увидят.\"\n",
      "choices": [
        { "text": "пройти испытания", "nextSceneId": "pillar_continue", "miniGame": "pillar_riddle" }
      ]
    },
    {
      "id": "pillar_continue",
      "text": "Столбы рушаться и появляеться выход — одно из зеркал начинает трястись, в нем появляется свет и голос: \n“Добро пожаловать… в правду.”\nТы проходишь сквозь него — и Ты оказываешься в детской палате той же клиники. Тут всё чисто и светло… но пусто.\nНа кровати — твоя фотография. На обороте — надпись:\n",
      "choices": [
        { "text": "Посмотреть фотографию", "nextSceneId": "true_continue", "miniGame": "true"}
      ]
    },
    {
      "id": "true_continue",
      "text": "Белый свет окутывает тебя. Ты просыпаешься. Вокруг — белая больничная палата. Свет. Тишина. Твои друзья стоят рядом, у них на глазах слёзы.Отец держит тебя за руку, дрожащим голосом шепчет: \n\"Ты вернулся… Сынок…\"\nИ ты вспоминаешь все, последняя ночь, ночевка с друзьями и эту чертову игру “Красная дверь, желтая дверь”.. ты все осознаешь․ \"Операция прошла успешно. Сознание восстановилось.- голос врача  как будто вывел  тебя из транса. Он продолжил - Но.. мне очень жаль донор не выжила. \nТы поворачиваешь голову и видишь — на столе лежит мамино фото. и ты все осознаешь.. Голова начинает кружиться. Камера медленно отдаляется. Последний кадр — твоё лицо в слезах. А за стеклом больничной палаты — отражение. Оно улыбается.\n ",
      "choices": [
        { "text": "Посмотреть фотографию", "nextSceneId": "true_continue", "miniGame": "true"}
      ]
    }

  ]
}